Revit 2027 API
AnalysisDisplayMarkersAndTextSettings.MarkerSize Property
 Size of marker.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MarkerSize { get; set; }
Public Property MarkerSize As Double
	Get
	Set
public:
property double MarkerSize {
	double get ();
	void set (double value);
}
member MarkerSize : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentsInconsistentException |  When setting this property: markerSize is negative
See Also
Reference
AnalysisDisplayMarkersAndTextSettings Class
Autodesk.Revit.DB.Analysis Namespace